//
//  LunarCore.swift
//  LunarCore-Swift
//
//  Created by Elors on 2016/11/6.
//  Copyright © 2016年 elors. All rights reserved.
//

import Foundation

private let minYear     = 1890     // 最小年限
private let maxYear     = 2100     // 最大年限
private let weekStart   = 0        // 周首日（可改成 app 配置）

/**
 *  获得本地化的字符串 这里 app 可以自行实现
 *
 *  @param text key
 *
 *  @return 本地化字符串
 */
private func i18n(key: String) -> String {
    return key
}

/**
 *  获得不为空的字符串
 *
 *  @param text text
 *
 *  @return text
 */
private func $(text: String?) -> String {
    return (text != nil ? text! : "")
}


/**
 *  缓存 主要是缓存节气信息
 */
private class LCMemoryCache: NSObject {
    
    var current: Int? {
        set {
            if newValue != current {
                self.current = newValue
                clear()
            }
        }
        get {
            return self.current
        }
    }
    var cache: [String: Any?]
    
    override init() {
        cache = [String: Any?]()
        super.init()
    }
    private func get(key: String) -> Any? {
        let a = cache[key] ?? nil
        return a
    }
    private func setKey(_ key: String, Value value: Any?) {
        cache[key] = value
    }
    private func clear() {
        cache.removeAll()
    }
}


// MARK: - LunarCore
class LunarCore {
    
    // Memory Cache
    private lazy var memoryCache: LCMemoryCache = {
        return LCMemoryCache()
    }()
    // GMT 0 的时区
    private lazy var timeZone: NSTimeZone = {
        return NSTimeZone(forSecondsFromGMT: 0)
    }()
    // 错误码表
    private lazy var errorCode: [Int: String] = {
        return [
            100: "输入的年份超过了可查询范围，仅支持1891至2100年",
            101: "参数输入错误，请查阅文档"
        ]
    }()
    // 1890 ~ 2100 年农历新年数据
    private lazy var springFestival: [Int] = {
        return [[1,21],[2,9],[1,30],[2,17],[2,6],[1,26],[2,14],[2,2],[1,22],[2,10],[1,31],[2,19],[2,8],[1,29],[2,16],[2,4],[1,25],[2,13],[2,2],[1,22],[2,10],[1,30],[2,18],[2,6],[1,26],[2,14],[2,4],[1,23],[2,11],[2,1],[2,20],[2,8],[1,28],[2,16],[2,5],[1,24],[2,13],[2,2],[1,23],[2,10],[1,30],[2,17],[2,6],[1,26],[2,14],[2,4],[1,24],[2,11],[1,31],[2,19],[2,8],[1,27],[2,15],[2,5],[1,25],[2,13],[2,2],[1,22],[2,10],[1,29],[2,17],[2,6],[1,27],[2,14],[2,3],[1,24],[2,12],[1,31],[2,18],[2,8],[1,28],[2,15],[2,5],[1,25],[2,13],[2,2],[1,21],[2,9],[1,30],[2,17],[2,6],[1,27],[2,15],[2,3],[1,23],[2,11],[1,31],[2,18],[2,7],[1,28],[2,16],[2,5],[1,25],[2,13],[2,2],[2,20],[2,9],[1,29],[2,17],[2,6],[1,27],[2,15],[2,4],[1,23],[2,10],[1,31],[2,19],[2,7],[1,28],[2,16],[2,5],[1,24],[2,12],[2,1],[1,22],[2,9],[1,29],[2,18],[2,7],[1,26],[2,14],[2,3],[1,23],[2,10],[1,31],[2,19],[2,8],[1,28],[2,16],[2,5],[1,25],[2,12],[2,1],[1,22],[2,10],[1,29],[2,17],[2,6],[1,26],[2,13],[2,3],[1,23],[2,11],[1,31],[2,19],[2,8],[1,28],[2,15],[2,4],[1,24],[2,12],[2,1],[1,22],[2,10],[1,30],[2,17],[2,6],[1,26],[2,14],[2,2],[1,23],[2,11],[2,1],[2,19],[2,8],[1,28],[2,15],[2,4],[1,24],[2,12],[2,2],[1,21],[2,9],[1,29],[2,17],[2,5],[1,26],[2,14],[2,3],[1,23],[2,11],[1,31],[2,19],[2,7],[1,27],[2,15],[2,5],[1,24],[2,12],[2,2],[1,22],[2,9],[1,29],[2,17],[2,6],[1,26],[2,14],[2,3],[1,24],[2,10],[1,30],[2,18],[2,7],[1,27],[2,15],[2,5],[1,25],[2,12],[2,1],[1,21],[2,9]]
    }()
    
    // 农历数据
    private lazy var lunarCalendarData: [String: [String]] = {
        return [
            "heavenlyStems": ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"], // 天干
            "earthlyBranches":["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"], // 地支
            "zodiac":["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"], // 对应地支十二生肖
            "solarTerm":["小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑", "白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪", "冬至"], // 二十四节气
            "monthCn":["正", "二", "三", "四", "五", "六", "七", "八", "九", "十", "冬", "腊"],
            "dateCn":["初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十", "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十", "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九", "三十", "卅一"]
        ]
    }()
    
    // 中国节日放假安排，外部设置，0无特殊安排，1工作，2放假
    private lazy var worktime: [String: [[String: Int]]] = {
        return [
            "y2013": ["d0101":2,"d0102":2,"d0103":2,"d0105":1,"d0106":1,"d0209":2,"d0210":2,"d0211":2,"d0212":2,"d0213":2,"d0214":2,"d0215":2,"d0216":1,"d0217":1,"d0404":2,"d0405":2,"d0406":2,"d0407":1,"d0427":1,"d0428":1,"d0429":2,"d0430":2,"d0501":2,"d0608":1,"d0609":1,"d0610":2,"d0611":2,"d0612":2,"d0919":2,"d0920":2,"d0921":2,"d0922":1,"d0929":1,"d1001":2,"d1002":2,"d1003":2,"d1004":2,"d1005":2,"d1006":2,"d1007":2,"d1012":1],
            "y2014": ["d0101":2,"d0126":1,"d0131":2,"d0201":2,"d0202":2,"d0203":2,"d0204":2,"d0205":2,"d0206":2,"d0208":1,"d0405":2,"d0407":2,"d0501":2,"d0502":2,"d0503":2,"d0504":1,"d0602":2,"d0908":2,"d0928":1,"d1001":2,"d1002":2,"d1003":2,"d1004":2,"d1005":2,"d1006":2,"d1007":2,"d1011":1],
            "y2015": ["d0101":2,"d0102":2,"d0103":2,"d0104":1,"d0215":1,"d0218":2,"d0219":2,"d0220":2,"d0221":2,"d0222":2,"d0223":2,"d0224":2,"d0228":1,"d0404":2,"d0405":2,"d0406":2,"d0501":2,"d0502":2,"d0503":2,"d0620":2,"d0621":2,"d0622":2,"d0903":2,"d0904":2,"d0905":2,"d0906":1,"d0926":2,"d0927":2,"d1001":2,"d1002":2,"d1003":2,"d1004":2,"d1005":2,"d1006":2,"d1007":2,"d1010":1],
            "y2016": ["d0101":2,"d0102":2,"d0103":2,"d0206":1,"d0207":2,"d0208":2,"d0209":2,"d0210":2,"d0211":2,"d0212":2,"d0213":2,"d0214":1,"d0402":2,"d0403":2,"d0404":2,"d0430":2,"d0501":2,"d0502":2,"d0609":2,"d0610":2,"d0611":2,"d0612":1,"d0915":2,"d0916":2,"d0917":2,"d0918":1,"d1001":2,"d1002":2,"d1003":2,"d1004":2,"d1005":2,"d1006":2,"d1007":2,"d1008":1,"d1009":1]
        ]
    }()

    // 公历节日
    // 星号表示不重要的节日
    // 破折号前面的是缩略写法
    private lazy var solarFestival: [String: String] = {
        return [
            "d0101":"元旦节",
            "d0120":"水瓶",
            "d0202":"湿地日-世界湿地日",
            "d0210":"*国际气象节",
            "d0214":"情人节",
            "d0219":"双鱼",
            "d0301":"*国际海豹日",
            "d0303":"*全国爱耳日",
            "d0305":"学雷锋-学雷锋纪念日",
            "d0308":"妇女节",
            "d0312":"植树节 孙中山逝世纪念日",
            "d0314":"*国际警察日",
            "d0315":"消费者-消费者权益日",
            "d0317":"*中国国医节 国际航海日",
            "d0321":"白羊 世界森林日 消除种族歧视国际日 世界儿歌日",
            "d0322":"*世界水日",
            "d0323":"*世界气象日",
            "d0324":"*世界防治结核病日",
            "d0325":"*全国中小学生安全教育日",
            "d0330":"*巴勒斯坦国土日",
            "d0401":"愚人节 全国爱国卫生运动月 税收宣传月",
            "d0407":"*世界卫生日",
            "d0420":"金牛",
            "d0422":"地球日-世界地球日",
            "d0423":"*世界图书和版权日",
            "d0424":"*亚非新闻工作者日",
            "d0501":"劳动节",
            "d0504":"青年节",
            "d0505":"*碘缺乏病防治日",
            "d0508":"*世界红十字日",
            "d0512":"护士节-国际护士节",
            "d0515":"*国际家庭日",
            "d0517":"*世界电信日",
            "d0518":"博物馆-国际博物馆日",
            "d0520":"*全国学生营养日",
            "d0521":"双子",
            "d0522":"*国际生物多样性日",
            "d0531":"*世界无烟日",
            "d0601":"儿童节-国际儿童节",
            "d0605":"环境日-世界环境日",
            "d0606":"*全国爱眼日",
            "d0617":"*防治荒漠化和干旱日",
            "d0622":"巨蟹",
            "d0623":"奥林匹克-国际奥林匹克日",
            "d0625":"*全国土地日",
            "d0626":"*国际禁毒日",
            "d0701":"建党节 香港回归纪念日 中共诞辰 世界建筑日",
            "d0702":"*国际体育记者日",
            "d0707":"*抗日战争纪念日",
            "d0711":"*世界人口日",
            "d0723":"狮子",
            "d0730":"*非洲妇女日",
            "d0801":"建军节",
            "d0808":"*中国男子节(爸爸节)",
            "d0823":"处女",
            "d0903":"抗日战争-抗日战争胜利纪念",
            "d0908":"*国际扫盲日 国际新闻工作者日",
            "d0909":"*毛泽东逝世纪念",
            "d0910":"教师节-中国教师节",
            "d0914":"*世界清洁地球日",
            "d0916":"*国际臭氧层保护日",
            "d0918":"*九一八事变纪念日",
            "d0920":"*国际爱牙日",
            "d0923":"天秤",
            "d0927":"*世界旅游日",
            "d0928":"*孔子诞辰",
            "d1001":"国庆节 世界音乐日 国际老人节",
            "d1002":"*国际和平与民主自由斗争日",
            "d1004":"*世界动物日",
            "d1006":"*老人节",
            "d1008":"*全国高血压日",
            "d1009":"*世界邮政日 万国邮联日",
            "d1010":"*辛亥革命纪念日 世界精神卫生日",
            "d1013":"*世界保健日 国际教师节",
            "d1014":"*世界标准日",
            "d1015":"*国际盲人节(白手杖节)",
            "d1016":"*世界粮食日",
            "d1017":"*世界消除贫困日",
            "d1022":"*世界传统医药日",
            "d1024":"天蝎 联合国日 世界发展信息日",
            "d1031":"万圣节 世界勤俭日",
            "d1107":"*十月社会主义革命纪念日",
            "d1108":"*中国记者日",
            "d1109":"*全国消防安全宣传教育日",
            "d1110":"*世界青年节",
            "d1111":"光棍节 国际科学与和平周(本日所属的一周)",
            "d1112":"*孙中山诞辰纪念日",
            "d1114":"*世界糖尿病日",
            "d1117":"*国际大学生节 世界学生节",
            "d1121":"*世界问候日 世界电视日",
            "d1123":"射手",
            "d1129":"*国际声援巴勒斯坦人民国际日",
            "d1201":"艾滋病-世界艾滋病日",
            "d1203":"*世界残疾人日",
            "d1205":"*国际经济和社会发展志愿人员日",
            "d1208":"*国际儿童电视日",
            "d1209":"*世界足球日",
            "d1210":"*世界人权日",
            "d1212":"*西安事变纪念日",
            "d1213":"*南京大屠杀(1937年)纪念日！紧记血泪史！",
            "d1220":"*澳门回归纪念",
            "d1221":"*国际篮球日",
            "d1222":"摩羯",
            "d1224":"平安夜",
            "d1225":"圣诞节",
            "d1226":"*毛泽东诞辰纪念"
        ]
    }()
    
    // 农历节日
    private lazy var lunarFestival: [String: String] = {
        return [
            "d0101":"春节",
            "d0115":"元宵节",
            "d0202":"龙抬头节",
            "d0505":"端午节",
            "d0707":"七夕节",
            "d0715":"中元节",
            "d0815":"中秋节",
            "d0909":"重阳节",
            "d1001":"寒衣节",
            "d1015":"下元节",
            "d1208":"腊八节",
            "d1223":"小年",
            "d0100":"除夕"
        ]
    }()

    // 周节日
    private lazy var weekFestival: [String: String] = {
        return [
            "0513":"*世界哮喘日",
            "0521":"母亲节-国际母亲节 救助贫困母亲日",
            "0531":"*全国助残日",
            "0533":"*国际牛奶日",
            "0627":"*中国文化遗产日",
            "0631":"父亲节",
            "0717":"*国际合作节",
            "0731":"*被奴役国家周",
            "0933":"*国际和平日",
            "0937":"*全民国防教育日",
            "0941":"*国际聋人节 世界儿童日",
            "0951":"*世界海事日 世界心脏病日",
            "1012":"*国际住房日 世界建筑日 世界人居日",
            "1024":"*国际减灾日",
            "1025":"*世界视觉日",
            "1145":"感恩节",
            "1221":"*国际儿童电视广播日"
        ]
    }()

    
    /**
     *  格式化日期
     *
     *  @param month 月份
     *  @param day   日期
     *
     *  @return 格式化后的日期
     */
    private func formatDay(month: Int, day: Int) -> String {
        return String(format: "d%02d%02d", (month+1), day)
    }
    
    /**
     *  以年月和长度构造一个日历
     *
     *  @param year  年
     *  @param month 月
     *  @param len   参数
     *  @param start 开始日期
     *
     *  @return 整月日历
     */
    private func createMonthData(year: Int, month: Int, len: Int, start: Int) -> [Dictionary<String, Int>] {
        
        var monthData: [Dictionary<String, Int>] = []
        
        if len < 1 {
            return monthData
        }
        
        var k = start
        for _ in 0...len {
            let dict = ["year": year, "month": month, "day": k]
            k += 1
            monthData.append(dict)
        }
        return monthData
    }
    
    /**
     *  构造 NSDate
     *
     *  @param year  年
     *  @param month 月
     *  @param day   日
     *
     *  @return NSDate
     */
    private func Date(year: Int, month: Int, day: Int) -> NSDate {
        let calendar = NSCalendar.current
        let comp = NSDateComponents()
        comp.year = year
        comp.month = month+1
        comp.day = day
        let date = calendar.dateFromComponents
        return date
    }
    
    /*
    NSDate *Date(int year, int month, int day) {
    NSCalendar *calendar = [NSCalendar currentCalendar];
    NSDateComponents *comp = [[NSDateComponents alloc] init];
    comp.year = year; comp.month = month + 1; comp.day = day;
    NSDate *date = [calendar dateFromComponents:comp];
    return date;
    }
    
    /**
     *  构造 NSDate
     *
     *  @param year  年
     *  @param month 月
     *  @param day   日
     *
     *  @return NSDate
     */
    NSDate *NewDate(int year, int month, int day) {
    return Date(year, month - 1, day);
    }
*/
}



